# Pandas

- Series
- DataFrames
- MissingData
- GroupBy
- Merging, Joining, and Concatenating
- Operations
- Data Input and Output

In [1]:
import numpy as np
import pandas as pd

## Series

Similar to a numpy array (built on top of it), but it can have labels.

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
s1 = pd.Series(data=my_data)
s1

0    10
1    20
2    30
dtype: int64

In [4]:
s2 = pd.Series(data=my_data, index=labels)
s2 = pd.Series(my_data, labels)
s2

a    10
b    20
c    30
dtype: int64

Series can hold various of object types.

In [5]:
# help(pd.Series)

## DataFrames

`df[column_name]`

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(
    data = randn(5, 4), 
    index = ['A', 'B', 'C', 'D', 'E'], 
    columns = ['W', 'X', 'Y', 'Z']
)

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Grab a single row with square bracket notation.

In [9]:
# get a single column as a series

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
# multiple columns

df[['X', 'W']]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [11]:
# make a new column as the sum of two other columns

df['new'] = df['W'] + df['Y']

In [12]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
# removing colummns

df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

When dropping a column/row, we  must set the axis (0 for rows, and 1 for columns).
If we want to modify the data frame, must set `inplace = True`

In [14]:
df.drop('new', axis=1, inplace=True)

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [17]:
df.shape

(5, 4)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selection

In [19]:
# Grab row based off index label

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [20]:
# Grab row via index numbering

df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [21]:
df.loc['B', 'Y']

-0.8480769834036315

In [22]:
df.iloc[1, 2]

-0.8480769834036315

In [23]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [24]:
df.iloc[[0, 1], [0, 2]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

In [25]:
df2 = df.copy()

In [26]:
df2 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
bool_df = df > 0
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [28]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

With a conditionial, we can get a series of booleans.

In [29]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

With that boolean series we can actually pass that in to the `dataframe` to filter out the rows.

In [30]:
# Filter out row that has value W less than 0

df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
result_df = df[df['Z'] > 0]
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [35]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [36]:
bool_series = df['W'] > 0
result = df[bool_series]

result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
result[['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

Conditional selection with multiple condition

In [38]:
df[(df['W']) > 0 and (df['Y'] > 0)] # this will cause an error

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [40]:
df[
    (df['W'] > 0) & (df['Y'] > 0)
]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

Reseting index (row label to regular number index)

Notice that the index labels got moved to its own column.

Must have inplace to make change

In [41]:
df.reset_index() # inplace=True, to modify dataframe

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
new_index = 'CA NY WY OR CO'.split()
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [44]:
df['State'] = new_index
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

If you want to change the index label use `.set_index`

In [45]:
df.set_index('State') # inplace=True, to modify df

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

## Part 3

In [46]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1, 2, 3] * 2

In [52]:
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [53]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [82]:
df3 = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])
df3

                   A         B
Groups Num
G1     1    0.041460 -0.411055
       2   -0.771329  0.110477
       3   -0.804652  0.253548
G2     1    0.649148  0.358941
       2   -1.080471  0.902398
       3    0.161781  0.833029

In [83]:
df3.loc['G1'].loc[1]

A    0.041460
B   -0.411055
Name: 1, dtype: float64

### Index Names

In [84]:
df3.index.names

FrozenList(['Groups', 'Num'])

In [86]:
df3.index.names = ['Groups', 'Num']

In [88]:
df3

                   A         B
Groups Num
G1     1    0.041460 -0.411055
       2   -0.771329  0.110477
       3   -0.804652  0.253548
G2     1    0.649148  0.358941
       2   -1.080471  0.902398
       3    0.161781  0.833029

In [93]:
df3.loc['G2'].loc[3]

A    0.161781
B    0.833029
Name: 3, dtype: float64

### Cross Section

For cross sections, we use `.xs` method. It can only be used for multi level indexed dataframes though.

In [95]:
df.xs('G1')

            A         B
Num
1    1.025984 -0.156598
2   -0.031579  0.649826
3    2.154846 -0.610259

In [98]:
# Get row 1 from each Group

df.xs(1, level='Num')

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419